Instructions

Create a dataframe called "employee_df" with the following data:

import pandas as pd

data = {'Name': ['John', 'Mary', 'Bob', 'Sarah', 'Tom', 'Lisa'], 'Department': ['IT', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing'], 'Age': [30, 40, 25, 35, 45, 28], 'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'], 'Salary': [50000, 60000, 45000, 55000, 70000, 55000], 'Experience': [3, 7, 2, 5, 10, 4]}

 employee_df = pd.DataFrame(data)

 

Use the iloc method to select the first 3 rows of the dataframe.
Use the loc method to select all rows where the Department is "Marketing".
Use the iloc method to select the Age and Gender columns for the first 4 rows of the dataframe.
Use the loc method to select the Salary and Experience columns for all rows where the Gender is "Male".
Note:

iloc is used for selection by index location
loc is used for selection by label.

In [11]:
import pandas as pd

In [15]:
data = {'Name': ['John', 'Mary', 'Bob', 'Sarah', 'Tom', 'Lisa'], 'Department': ['IT', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing'], 
        'Age': [30, 40, 25, 35, 45, 28], 'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'], 
        'Salary': [50000, 60000, 45000, 55000, 70000, 55000], 'Experience': [3, 7, 2, 5, 10, 4]}

employee_df = pd.DataFrame(data)

In [17]:
employee_df

    Name Department  Age  Gender  Salary  Experience
0   John         IT   30    Male   50000           3
1   Mary  Marketing   40  Female   60000           7
2    Bob      Sales   25    Male   45000           2
3  Sarah         IT   35  Female   55000           5
4    Tom    Finance   45    Male   70000          10
5   Lisa  Marketing   28  Female   55000           4

In [19]:
#Use the iloc method to select the first 3 rows of the dataframe
df_first3rows= employee_df.iloc[0:3]

In [21]:
df_first3rows

   Name Department  Age  Gender  Salary  Experience
0  John         IT   30    Male   50000           3
1  Mary  Marketing   40  Female   60000           7
2   Bob      Sales   25    Male   45000           2

In [23]:
# Use the loc method to select all rows where the Department is "Marketing"
employee_in_marketing = employee_df.loc[employee_df["Department"] == "Marketing"]

In [25]:
employee_in_marketing

   Name Department  Age  Gender  Salary  Experience
1  Mary  Marketing   40  Female   60000           7
5  Lisa  Marketing   28  Female   55000           4

In [29]:
#Use the iloc method to select the Age and Gender columns for the first 4 rows of the dataframe. 
first4rowsA_G = employee_df.iloc[:4, [2, 3]]

print(first4rowsA_G)

   Age  Gender
0   30    Male
1   40  Female
2   25    Male
3   35  Female

In [52]:
#Use the loc method to select the Salary and Experience columns for all rows where the Gender is "Male".
Male_salary_experience = employee_df.loc[employee_df["Gender"]=="Male", ["Salary","Experience"]]
Male_salary_experience

   Salary  Experience
0   50000           3
2   45000           2
4   70000          10